ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/**
 * \brief Component description for PIC32CX/0525SG12 SMB
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_SMB_COMPONENT_H_
#define _PIC32CX_0525SG12_SMB_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_SMB The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SMB */
/* ========================================================================== */

/* -------- SMB_CONTROL : (SMB Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t ACK:1;                     /**< bit:      0  The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. */
    uint32_t STO:1;                     /**< bit:      1  See STA description                           */
    uint32_t STA:1;                     /**< bit:      2  The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition */
    uint32_t ENI:1;                     /**< bit:      3  Enable Interrupt bit (ENI) controls the Interrupt Interface */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t ESO:1;                     /**< bit:      6  The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) */
    uint32_t PIN:1;                     /**< bit:      7  The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_CONTROL_bits_t;
#define SMB_CONTROL_RESETVALUE              (0x00U)                                       /**<  (SMB_CONTROL) Control Register  Reset Value */

#define SMB_CONTROL_ACK_Pos                   (0)                                            /**< (SMB_CONTROL) The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. Position */
#define SMB_CONTROL_ACK_Msk                   (0x1U << SMB_CONTROL_ACK_Pos)                  /**< (SMB_CONTROL) The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. Mask */
#define SMB_CONTROL_STO_Pos                   (1)                                            /**< (SMB_CONTROL) See STA description Position */
#define SMB_CONTROL_STO_Msk                   (0x1U << SMB_CONTROL_STO_Pos)                  /**< (SMB_CONTROL) See STA description Mask */
#define SMB_CONTROL_STA_Pos                   (2)                                            /**< (SMB_CONTROL) The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition Position */
#define SMB_CONTROL_STA_Msk                   (0x1U << SMB_CONTROL_STA_Pos)                  /**< (SMB_CONTROL) The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition Mask */
#define SMB_CONTROL_ENI_Pos                   (3)                                            /**< (SMB_CONTROL) Enable Interrupt bit (ENI) controls the Interrupt Interface Position */
#define SMB_CONTROL_ENI_Msk                   (0x1U << SMB_CONTROL_ENI_Pos)                  /**< (SMB_CONTROL) Enable Interrupt bit (ENI) controls the Interrupt Interface Mask */
#define SMB_CONTROL_ESO_Pos                   (6)                                            /**< (SMB_CONTROL) The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) Position */
#define SMB_CONTROL_ESO_Msk                   (0x1U << SMB_CONTROL_ESO_Pos)                  /**< (SMB_CONTROL) The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) Mask */
#define SMB_CONTROL_PIN_Pos                   (7)                                            /**< (SMB_CONTROL) The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. Position */
#define SMB_CONTROL_PIN_Msk                   (0x1U << SMB_CONTROL_PIN_Pos)                  /**< (SMB_CONTROL) The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. Mask */
#define SMB_CONTROL_Msk                       (0x000000CFUL)                                 /**< (SMB_CONTROL) Register Mask  */

/* -------- SMB_STATUS : (SMB Offset: 0x00) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t NBB:1;                     /**< bit:      0  The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. */
    uint32_t LAB:1;                     /**< bit:      1  The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus */
    uint32_t AAS:1;                     /**< bit:      2  The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received */
    uint32_t LRB_AD0:1;                 /**< bit:      3  The Last Received Bit  or Address 0 (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. */
    uint32_t BER:1;                     /**< bit:      4  When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. */
    uint32_t STS:1;                     /**< bit:      5  When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. */
    uint32_t SAD:1;                     /**< bit:      6  SMBus Address Decoded (SAD)                   */
    uint32_t PIN:1;                     /**< bit:      7  Pending Interrupt bit                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_STATUS_bits_t;
