ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_STATUS_RESETVALUE               (0x00U)                                       /**<  (SMB_STATUS) Status Register  Reset Value */

#define SMB_STATUS_NBB_Pos                    (0)                                            /**< (SMB_STATUS) The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. Position */
#define SMB_STATUS_NBB_Msk                    (0x1U << SMB_STATUS_NBB_Pos)                   /**< (SMB_STATUS) The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. Mask */
#define SMB_STATUS_LAB_Pos                    (1)                                            /**< (SMB_STATUS) The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus Position */
#define SMB_STATUS_LAB_Msk                    (0x1U << SMB_STATUS_LAB_Pos)                   /**< (SMB_STATUS) The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus Mask */
#define SMB_STATUS_AAS_Pos                    (2)                                            /**< (SMB_STATUS) The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received Position */
#define SMB_STATUS_AAS_Msk                    (0x1U << SMB_STATUS_AAS_Pos)                   /**< (SMB_STATUS) The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received Mask */
#define SMB_STATUS_LRB_AD0_Pos                (3)                                            /**< (SMB_STATUS) The Last Received Bit  or Address 0 (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. Position */
#define SMB_STATUS_LRB_AD0_Msk                (0x1U << SMB_STATUS_LRB_AD0_Pos)               /**< (SMB_STATUS) The Last Received Bit  or Address 0 (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. Mask */
#define SMB_STATUS_BER_Pos                    (4)                                            /**< (SMB_STATUS) When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. Position */
#define SMB_STATUS_BER_Msk                    (0x1U << SMB_STATUS_BER_Pos)                   /**< (SMB_STATUS) When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. Mask */
#define SMB_STATUS_STS_Pos                    (5)                                            /**< (SMB_STATUS) When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. Position */
#define SMB_STATUS_STS_Msk                    (0x1U << SMB_STATUS_STS_Pos)                   /**< (SMB_STATUS) When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. Mask */
#define SMB_STATUS_SAD_Pos                    (6)                                            /**< (SMB_STATUS) SMBus Address Decoded (SAD) Position */
#define SMB_STATUS_SAD_Msk                    (0x1U << SMB_STATUS_SAD_Pos)                   /**< (SMB_STATUS) SMBus Address Decoded (SAD) Mask */
#define SMB_STATUS_PIN_Pos                    (7)                                            /**< (SMB_STATUS) Pending Interrupt bit Position */
#define SMB_STATUS_PIN_Msk                    (0x1U << SMB_STATUS_PIN_Pos)                   /**< (SMB_STATUS) Pending Interrupt bit Mask */
#define SMB_STATUS_Msk                        (0x000000FFUL)                                 /**< (SMB_STATUS) Register Mask  */

/* -------- SMB_OWN : (SMB Offset: 0x04) (R/W 32) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. -------- */

typedef union
{
  struct
  {
    uint32_t OWN_ADDRESS_1:7;           /**< bit:   0..6  The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t OWN_ADDRESS_2:7;           /**< bit:  8..14  The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_OWN_bits_t;
#define SMB_OWN_RESETVALUE                  (0x00U)                                       /**<  (SMB_OWN) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address.  Reset Value */

