ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_OWN_OWN_ADDRESS_1_Pos             (0)                                            /**< (SMB_OWN) The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Position */
#define SMB_OWN_OWN_ADDRESS_1_Msk             (0x7FU << SMB_OWN_OWN_ADDRESS_1_Pos)           /**< (SMB_OWN) The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Mask */
#define SMB_OWN_OWN_ADDRESS_1(value)          (SMB_OWN_OWN_ADDRESS_1_Msk & ((value) << SMB_OWN_OWN_ADDRESS_1_Pos))
#define SMB_OWN_OWN_ADDRESS_2_Pos             (8)                                            /**< (SMB_OWN) The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Position */
#define SMB_OWN_OWN_ADDRESS_2_Msk             (0x7FU << SMB_OWN_OWN_ADDRESS_2_Pos)           /**< (SMB_OWN) The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Mask */
#define SMB_OWN_OWN_ADDRESS_2(value)          (SMB_OWN_OWN_ADDRESS_2_Msk & ((value) << SMB_OWN_OWN_ADDRESS_2_Pos))
#define SMB_OWN_Msk                           (0x00007F7FUL)                                 /**< (SMB_OWN) Register Mask  */

/* -------- SMB_DATA_REG : (SMB Offset: 0x08) (R/W 8) This register holds the data that are either shifted out to or shifted in from the I2C port. -------- */

typedef union
{
  uint8_t  w;
} __SMB_DATA_REG_bits_t;
#define SMB_DATA_REG_RESETVALUE             (0x00U)                                       /**<  (SMB_DATA_REG) This register holds the data that are either shifted out to or shifted in from the I2C port.  Reset Value */

#define SMB_DATA_REG_Msk                      (0x00000000UL)                                 /**< (SMB_DATA_REG) Register Mask  */

/* -------- SMB_MASTER_COMMAND : (SMB Offset: 0x0c) (R/W 32) SMBus Master Command Register -------- */

typedef union
{
  struct
  {
    uint32_t MRUN:1;                    /**< bit:      0  While this bit is 1, transfer bytes over SMBus. As long as WriteCount is non-zero, a byte from the Master Transmit Buffer is transmitted to the slave device and WriteCount is decremented. */
    uint32_t MPROCEED:1;                /**< bit:      1  When this bit is 0, the Master State Machine does not transition out of the IDLE or PAUSE states. When this bit is 1, the Master State Machine immediately transitions to the WAIT-BUSBUSY and MRUN-RECEIVE states, respectively. */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t START0:1;                  /**< bit:      8  If this bit is 1, send a Start bit on the SMBus before the first byte of the WriteCount is sent to the SMBus transmitter. */
    uint32_t STARTN:1;                  /**< bit:      9  If this bit is 1, send a Start bit just before the last byte of the WriteCount is sent to the SMBus transmitter. */
    uint32_t STOP:1;                    /**< bit:     10  If this bit is 1, send a Stop bit after the transaction completes. */
    uint32_t PEC_TERM:1;                /**< bit:     11  If this bit is 1, a copy of the PEC register is transmitted when WriteCount is 0. After the PEC register is read, both the PEC register and this bit are cleared to 0. */
    uint32_t READM:1;                   /**< bit:     12  If this bit is 1, then the ReadCount field is replaced by the byte that is read from the SMBus when ReadCount[7:0] is 1. After ReadCount[7:0] is updated, this bit is cleared to 0. */
    uint32_t READ_PEC:1;                /**< bit:     13  If this bit is 0, reading from the SMBus stops when ReadCount reaches 0. If this bit is 1, reading continues when ReadCount is 0 for one more byte. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t WRITE_COUNT:8;             /**< bit: 16..23  This field is a count of the number of bytes to transmit to the SMBus from the SMBus Master Transmit Buffer Register It is decremented by 1 for each byte written to the SMBus from the SMBus Master Transmit Buffer Register. */
    uint32_t READ_COUNT:8;              /**< bit: 24..31  This field is a count of the number of bytes to read in from the SMBus to the SMBus Master Receive Buffer Register and must be greater than 0 in order for the Master State Machine to initiate a read phase. It is decremented by 1 for each byte read from the SMBus into the SMBus Master Receive Buffer Register. It can be overwritten by the first byte read in from the SMBus. */
  };
  uint32_t w;
} __SMB_MASTER_COMMAND_bits_t;
#define SMB_MASTER_COMMAND_RESETVALUE       (0x00U)                                       /**<  (SMB_MASTER_COMMAND) SMBus Master Command Register  Reset Value */

#define SMB_MASTER_COMMAND_MRUN_Pos           (0)                                            /**< (SMB_MASTER_COMMAND) While this bit is 1, transfer bytes over SMBus. As long as WriteCount is non-zero, a byte from the Master Transmit Buffer is transmitted to the slave device and WriteCount is decremented. Position */
#define SMB_MASTER_COMMAND_MRUN_Msk           (0x1U << SMB_MASTER_COMMAND_MRUN_Pos)          /**< (SMB_MASTER_COMMAND) While this bit is 1, transfer bytes over SMBus. As long as WriteCount is non-zero, a byte from the Master Transmit Buffer is transmitted to the slave device and WriteCount is decremented. Mask */
#define SMB_MASTER_COMMAND_MPROCEED_Pos       (1)                                            /**< (SMB_MASTER_COMMAND) When this bit is 0, the Master State Machine does not transition out of the IDLE or PAUSE states. When this bit is 1, the Master State Machine immediately transitions to the WAIT-BUSBUSY and MRUN-RECEIVE states, respectively. Position */
#define SMB_MASTER_COMMAND_MPROCEED_Msk       (0x1U << SMB_MASTER_COMMAND_MPROCEED_Pos)      /**< (SMB_MASTER_COMMAND) When this bit is 0, the Master State Machine does not transition out of the IDLE or PAUSE states. When this bit is 1, the Master State Machine immediately transitions to the WAIT-BUSBUSY and MRUN-RECEIVE states, respectively. Mask */
#define SMB_MASTER_COMMAND_START0_Pos         (8)                                            /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Start bit on the SMBus before the first byte of the WriteCount is sent to the SMBus transmitter. Position */
#define SMB_MASTER_COMMAND_START0_Msk         (0x1U << SMB_MASTER_COMMAND_START0_Pos)        /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Start bit on the SMBus before the first byte of the WriteCount is sent to the SMBus transmitter. Mask */
#define SMB_MASTER_COMMAND_STARTN_Pos         (9)                                            /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Start bit just before the last byte of the WriteCount is sent to the SMBus transmitter. Position */
#define SMB_MASTER_COMMAND_STARTN_Msk         (0x1U << SMB_MASTER_COMMAND_STARTN_Pos)        /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Start bit just before the last byte of the WriteCount is sent to the SMBus transmitter. Mask */
#define SMB_MASTER_COMMAND_STOP_Pos           (10)                                           /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Stop bit after the transaction completes. Position */
#define SMB_MASTER_COMMAND_STOP_Msk           (0x1U << SMB_MASTER_COMMAND_STOP_Pos)          /**< (SMB_MASTER_COMMAND) If this bit is 1, send a Stop bit after the transaction completes. Mask */
#define SMB_MASTER_COMMAND_PEC_TERM_Pos       (11)                                           /**< (SMB_MASTER_COMMAND) If this bit is 1, a copy of the PEC register is transmitted when WriteCount is 0. After the PEC register is read, both the PEC register and this bit are cleared to 0. Position */
#define SMB_MASTER_COMMAND_PEC_TERM_Msk       (0x1U << SMB_MASTER_COMMAND_PEC_TERM_Pos)      /**< (SMB_MASTER_COMMAND) If this bit is 1, a copy of the PEC register is transmitted when WriteCount is 0. After the PEC register is read, both the PEC register and this bit are cleared to 0. Mask */
#define SMB_MASTER_COMMAND_READM_Pos          (12)                                           /**< (SMB_MASTER_COMMAND) If this bit is 1, then the ReadCount field is replaced by the byte that is read from the SMBus when ReadCount[7:0] is 1. After ReadCount[7:0] is updated, this bit is cleared to 0. Position */
#define SMB_MASTER_COMMAND_READM_Msk          (0x1U << SMB_MASTER_COMMAND_READM_Pos)         /**< (SMB_MASTER_COMMAND) If this bit is 1, then the ReadCount field is replaced by the byte that is read from the SMBus when ReadCount[7:0] is 1. After ReadCount[7:0] is updated, this bit is cleared to 0. Mask */
#define SMB_MASTER_COMMAND_READ_PEC_Pos       (13)                                           /**< (SMB_MASTER_COMMAND) If this bit is 0, reading from the SMBus stops when ReadCount reaches 0. If this bit is 1, reading continues when ReadCount is 0 for one more byte. Position */
#define SMB_MASTER_COMMAND_READ_PEC_Msk       (0x1U << SMB_MASTER_COMMAND_READ_PEC_Pos)      /**< (SMB_MASTER_COMMAND) If this bit is 0, reading from the SMBus stops when ReadCount reaches 0. If this bit is 1, reading continues when ReadCount is 0 for one more byte. Mask */
#define SMB_MASTER_COMMAND_WRITE_COUNT_Pos    (16)                                           /**< (SMB_MASTER_COMMAND) This field is a count of the number of bytes to transmit to the SMBus from the SMBus Master Transmit Buffer Register It is decremented by 1 for each byte written to the SMBus from the SMBus Master Transmit Buffer Register. Position */
#define SMB_MASTER_COMMAND_WRITE_COUNT_Msk    (0xFFU << SMB_MASTER_COMMAND_WRITE_COUNT_Pos)  /**< (SMB_MASTER_COMMAND) This field is a count of the number of bytes to transmit to the SMBus from the SMBus Master Transmit Buffer Register It is decremented by 1 for each byte written to the SMBus from the SMBus Master Transmit Buffer Register. Mask */
#define SMB_MASTER_COMMAND_WRITE_COUNT(value) (SMB_MASTER_COMMAND_WRITE_COUNT_Msk & ((value) << SMB_MASTER_COMMAND_WRITE_COUNT_Pos))
#define SMB_MASTER_COMMAND_READ_COUNT_Pos     (24)                                           /**< (SMB_MASTER_COMMAND) This field is a count of the number of bytes to read in from the SMBus to the SMBus Master Receive Buffer Register and must be greater than 0 in order for the Master State Machine to initiate a read phase. It is decremented by 1 for each byte read from the SMBus into the SMBus Master Receive Buffer Register. It can be overwritten by the first byte read in from the SMBus. Position */
#define SMB_MASTER_COMMAND_READ_COUNT_Msk     (0xFFU << SMB_MASTER_COMMAND_READ_COUNT_Pos)   /**< (SMB_MASTER_COMMAND) This field is a count of the number of bytes to read in from the SMBus to the SMBus Master Receive Buffer Register and must be greater than 0 in order for the Master State Machine to initiate a read phase. It is decremented by 1 for each byte read from the SMBus into the SMBus Master Receive Buffer Register. It can be overwritten by the first byte read in from the SMBus. Mask */
#define SMB_MASTER_COMMAND_READ_COUNT(value)  (SMB_MASTER_COMMAND_READ_COUNT_Msk & ((value) << SMB_MASTER_COMMAND_READ_COUNT_Pos))
#define SMB_MASTER_COMMAND_Msk                (0xFFFF3F03UL)                                 /**< (SMB_MASTER_COMMAND) Register Mask  */

/* -------- SMB_SLAVE_COMMAND : (SMB Offset: 0x10) (R/W 32) SMBus Slave Command Register -------- */

typedef union
{
  struct
  {
    uint32_t SRUN:1;                    /**< bit:      0  Setting this bit to 1 enables the Slave State Machine to operate. */
    uint32_t SPROCEED:1;                /**< bit:      1  When this bit is 0, the Slave State Machine does not transition out of the IDLE, REPEAT_START_WRITE or REPEAT_START_READ states. When this bit is 1, the Slave State Machine immediately transitions to the START_WAIT, RECEIVE and TRANSMIT states, respectively. */
    uint32_t SLAVE_PEC:1;               /**< bit:      2  If Slave_WriteCount is 0 and Slave_PEC is 1 when the Master requests data, the PEC Register is copied to the DATA register. After the PEC Register is copied to the SMBus, the PEC Register is cleared and Slave_PEC is set to 0. */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t SLAVE_WRITECOUNT:8;        /**< bit:  8..15  This field is set to the number of bytes software expects to send to the Master. */
    uint32_t SLAVE_READCOUNT:8;         /**< bit: 16..23  This field is decremented each time a byte is copied from DATA to the SMBus Slave Receive Buffer Register. */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_SLAVE_COMMAND_bits_t;
