ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_SLAVE_COMMAND_RESETVALUE        (0x00U)                                       /**<  (SMB_SLAVE_COMMAND) SMBus Slave Command Register  Reset Value */

#define SMB_SLAVE_COMMAND_SRUN_Pos            (0)                                            /**< (SMB_SLAVE_COMMAND) Setting this bit to 1 enables the Slave State Machine to operate. Position */
#define SMB_SLAVE_COMMAND_SRUN_Msk            (0x1U << SMB_SLAVE_COMMAND_SRUN_Pos)           /**< (SMB_SLAVE_COMMAND) Setting this bit to 1 enables the Slave State Machine to operate. Mask */
#define SMB_SLAVE_COMMAND_SPROCEED_Pos        (1)                                            /**< (SMB_SLAVE_COMMAND) When this bit is 0, the Slave State Machine does not transition out of the IDLE, REPEAT_START_WRITE or REPEAT_START_READ states. When this bit is 1, the Slave State Machine immediately transitions to the START_WAIT, RECEIVE and TRANSMIT states, respectively. Position */
#define SMB_SLAVE_COMMAND_SPROCEED_Msk        (0x1U << SMB_SLAVE_COMMAND_SPROCEED_Pos)       /**< (SMB_SLAVE_COMMAND) When this bit is 0, the Slave State Machine does not transition out of the IDLE, REPEAT_START_WRITE or REPEAT_START_READ states. When this bit is 1, the Slave State Machine immediately transitions to the START_WAIT, RECEIVE and TRANSMIT states, respectively. Mask */
#define SMB_SLAVE_COMMAND_SLAVE_PEC_Pos       (2)                                            /**< (SMB_SLAVE_COMMAND) If Slave_WriteCount is 0 and Slave_PEC is 1 when the Master requests data, the PEC Register is copied to the DATA register. After the PEC Register is copied to the SMBus, the PEC Register is cleared and Slave_PEC is set to 0. Position */
#define SMB_SLAVE_COMMAND_SLAVE_PEC_Msk       (0x1U << SMB_SLAVE_COMMAND_SLAVE_PEC_Pos)      /**< (SMB_SLAVE_COMMAND) If Slave_WriteCount is 0 and Slave_PEC is 1 when the Master requests data, the PEC Register is copied to the DATA register. After the PEC Register is copied to the SMBus, the PEC Register is cleared and Slave_PEC is set to 0. Mask */
#define SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT_Pos (8)                                            /**< (SMB_SLAVE_COMMAND) This field is set to the number of bytes software expects to send to the Master. Position */
#define SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT_Msk (0xFFU << SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT_Pos)  /**< (SMB_SLAVE_COMMAND) This field is set to the number of bytes software expects to send to the Master. Mask */
#define SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT(value) (SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT_Msk & ((value) << SMB_SLAVE_COMMAND_SLAVE_WRITECOUNT_Pos))
#define SMB_SLAVE_COMMAND_SLAVE_READCOUNT_Pos (16)                                           /**< (SMB_SLAVE_COMMAND) This field is decremented each time a byte is copied from DATA to the SMBus Slave Receive Buffer Register. Position */
#define SMB_SLAVE_COMMAND_SLAVE_READCOUNT_Msk (0xFFU << SMB_SLAVE_COMMAND_SLAVE_READCOUNT_Pos)  /**< (SMB_SLAVE_COMMAND) This field is decremented each time a byte is copied from DATA to the SMBus Slave Receive Buffer Register. Mask */
#define SMB_SLAVE_COMMAND_SLAVE_READCOUNT(value) (SMB_SLAVE_COMMAND_SLAVE_READCOUNT_Msk & ((value) << SMB_SLAVE_COMMAND_SLAVE_READCOUNT_Pos))
#define SMB_SLAVE_COMMAND_Msk                 (0x00FFFF07UL)                                 /**< (SMB_SLAVE_COMMAND) Register Mask  */

/* -------- SMB_PEC : (SMB Offset: 0x14) (R/W 32) Packet Error Check (PEC) Register -------- */

typedef union
{
  struct
  {
    uint32_t PEC:8;                     /**< bit:   0..7  The SMBus Packet Error Check (PEC) byte.      */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_PEC_bits_t;
#define SMB_PEC_RESETVALUE                  (0x00U)                                       /**<  (SMB_PEC) Packet Error Check (PEC) Register  Reset Value */

#define SMB_PEC_PEC_Pos                       (0)                                            /**< (SMB_PEC) The SMBus Packet Error Check (PEC) byte. Position */
#define SMB_PEC_PEC_Msk                       (0xFFU << SMB_PEC_PEC_Pos)                     /**< (SMB_PEC) The SMBus Packet Error Check (PEC) byte. Mask */
#define SMB_PEC_PEC(value)                    (SMB_PEC_PEC_Msk & ((value) << SMB_PEC_PEC_Pos))
#define SMB_PEC_Msk                           (0x000000FFUL)                                 /**< (SMB_PEC) Register Mask  */

/* -------- SMB_REPEATED_START_HOLD_TIME : (SMB Offset: 0x18) (R/W 32) Repeated Start Hold Time Register -------- */

typedef union
{
  struct
  {
    uint32_t RPT_START_HOLD_TIME:8;     /**< bit:   0..7  This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_REPEATED_START_HOLD_TIME_bits_t;
#define SMB_REPEATED_START_HOLD_TIME_RESETVALUE (0x4DU)                                       /**<  (SMB_REPEATED_START_HOLD_TIME) Repeated Start Hold Time Register  Reset Value */

#define SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos (0)                                            /**< (SMB_REPEATED_START_HOLD_TIME) This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. Position */
#define SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Msk (0xFFU << SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos)  /**< (SMB_REPEATED_START_HOLD_TIME) This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. Mask */
#define SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME(value) (SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Msk & ((value) << SMB_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos))
#define SMB_REPEATED_START_HOLD_TIME_Msk      (0x000000FFUL)                                 /**< (SMB_REPEATED_START_HOLD_TIME) Register Mask  */

