ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/* -------- SMB_COMPLETION : (SMB Offset: 0x20) (R/W 32) Completion Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t DTEN:1;                    /**< bit:      2  When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. */
    uint32_t MCEN:1;                    /**< bit:      3  When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. */
    uint32_t SCEN:1;                    /**< bit:      4  When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. */
    uint32_t BIDEN:1;                   /**< bit:      5  When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. */
    uint32_t TIMERR:1;                  /**< bit:      6  The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t DTO:1;                     /**< bit:      8  DTO is the Device Time-out bit. (R/WC)        */
    uint32_t MCTO:1;                    /**< bit:      9  MCTO is the Master Cumulative Time-out bit. (R/WC) */
    uint32_t SCTO:1;                    /**< bit:     10  SCTO is the Slave Cumulative Time-out bit(R/WC) */
    uint32_t CHDL:1;                    /**< bit:     11  CHDL is the clock high time-out detect bit(R/WC) */
    uint32_t CHDH:1;                    /**< bit:     12  CHDH is the bus idle time-out detect bit(R/WC) */
    uint32_t BER:1;                     /**< bit:     13  If this bit is 1, the BER bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) */
    uint32_t LAB:1;                     /**< bit:     14  If this bit is 1, the LAB bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t SNAKR:1;                   /**< bit:     16  If this bit is 1, the Slave state machine sent a NACK to the transmitting Master while the Slave was receiving data from the SMBus interface. */
    uint32_t STR:1;                     /**< bit:     17  0: Slave has just finished the receive phase of a transaction. \n                1: Slave has just finished the transmit phase of a transaction. */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t SPROT:1;                   /**< bit:     19  If this bit is 1, the WriteCount[7:0] counter in the Slave state machine either counted down to 0 before the Master sent a NACK signal, or the Slave received a NACK signal before the counter reached 0. */
    uint32_t REPEAT_READ:1;             /**< bit:     20  If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 1, indicating that the Master requested a Read operation. */
    uint32_t REPEAT_WRITE:1;            /**< bit:     21  If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 0, indicating that the Master requested a Write operation. */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t MNAKX:1;                   /**< bit:     24  If this bit is 1, the Master state machine received a NACK from the receiving Slave while the Master was transmitting data over the SMBus interface. (R/WC) */
    uint32_t MTR:1;                     /**< bit:     25  0: Master has just finished the receive phase of a transaction. \n                1: Master has just finished the transmit phase of a transaction. */
    uint32_t :3;                        /**< bit: 26..28  Reserved                                      */
    uint32_t IDLE:1;                    /**< bit:     29  This bit is set when the I2C bus becomes idle (on the rising edge of nBB). (R/WC) */
    uint32_t MDONE:1;                   /**< bit:     30  If this bit is 1, Master State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect. (R/WC) */
    uint32_t SDONE:1;                   /**< bit:     31  If this bit is 1, Slave State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect.(R/WC) */
  };
  uint32_t w;
} __SMB_COMPLETION_bits_t;
#define SMB_COMPLETION_RESETVALUE           (0x00U)                                       /**<  (SMB_COMPLETION) Completion Register  Reset Value */

#define SMB_COMPLETION_DTEN_Pos               (2)                                            /**< (SMB_COMPLETION) When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. Position */
#define SMB_COMPLETION_DTEN_Msk               (0x1U << SMB_COMPLETION_DTEN_Pos)              /**< (SMB_COMPLETION) When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. Mask */
#define SMB_COMPLETION_MCEN_Pos               (3)                                            /**< (SMB_COMPLETION) When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. Position */
#define SMB_COMPLETION_MCEN_Msk               (0x1U << SMB_COMPLETION_MCEN_Pos)              /**< (SMB_COMPLETION) When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. Mask */
#define SMB_COMPLETION_SCEN_Pos               (4)                                            /**< (SMB_COMPLETION) When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. Position */
#define SMB_COMPLETION_SCEN_Msk               (0x1U << SMB_COMPLETION_SCEN_Pos)              /**< (SMB_COMPLETION) When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. Mask */
#define SMB_COMPLETION_BIDEN_Pos              (5)                                            /**< (SMB_COMPLETION) When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. Position */
#define SMB_COMPLETION_BIDEN_Msk              (0x1U << SMB_COMPLETION_BIDEN_Pos)             /**< (SMB_COMPLETION) When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. Mask */
#define SMB_COMPLETION_TIMERR_Pos             (6)                                            /**< (SMB_COMPLETION) The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. Position */
#define SMB_COMPLETION_TIMERR_Msk             (0x1U << SMB_COMPLETION_TIMERR_Pos)            /**< (SMB_COMPLETION) The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. Mask */
#define SMB_COMPLETION_DTO_Pos                (8)                                            /**< (SMB_COMPLETION) DTO is the Device Time-out bit. (R/WC) Position */
#define SMB_COMPLETION_DTO_Msk                (0x1U << SMB_COMPLETION_DTO_Pos)               /**< (SMB_COMPLETION) DTO is the Device Time-out bit. (R/WC) Mask */
#define SMB_COMPLETION_MCTO_Pos               (9)                                            /**< (SMB_COMPLETION) MCTO is the Master Cumulative Time-out bit. (R/WC) Position */
#define SMB_COMPLETION_MCTO_Msk               (0x1U << SMB_COMPLETION_MCTO_Pos)              /**< (SMB_COMPLETION) MCTO is the Master Cumulative Time-out bit. (R/WC) Mask */
#define SMB_COMPLETION_SCTO_Pos               (10)                                           /**< (SMB_COMPLETION) SCTO is the Slave Cumulative Time-out bit(R/WC) Position */
#define SMB_COMPLETION_SCTO_Msk               (0x1U << SMB_COMPLETION_SCTO_Pos)              /**< (SMB_COMPLETION) SCTO is the Slave Cumulative Time-out bit(R/WC) Mask */
#define SMB_COMPLETION_CHDL_Pos               (11)                                           /**< (SMB_COMPLETION) CHDL is the clock high time-out detect bit(R/WC) Position */
#define SMB_COMPLETION_CHDL_Msk               (0x1U << SMB_COMPLETION_CHDL_Pos)              /**< (SMB_COMPLETION) CHDL is the clock high time-out detect bit(R/WC) Mask */
#define SMB_COMPLETION_CHDH_Pos               (12)                                           /**< (SMB_COMPLETION) CHDH is the bus idle time-out detect bit(R/WC) Position */
#define SMB_COMPLETION_CHDH_Msk               (0x1U << SMB_COMPLETION_CHDH_Pos)              /**< (SMB_COMPLETION) CHDH is the bus idle time-out detect bit(R/WC) Mask */
#define SMB_COMPLETION_BER_Pos                (13)                                           /**< (SMB_COMPLETION) If this bit is 1, the BER bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) Position */
#define SMB_COMPLETION_BER_Msk                (0x1U << SMB_COMPLETION_BER_Pos)               /**< (SMB_COMPLETION) If this bit is 1, the BER bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) Mask */
#define SMB_COMPLETION_LAB_Pos                (14)                                           /**< (SMB_COMPLETION) If this bit is 1, the LAB bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) Position */
#define SMB_COMPLETION_LAB_Msk                (0x1U << SMB_COMPLETION_LAB_Pos)               /**< (SMB_COMPLETION) If this bit is 1, the LAB bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC) Mask */
#define SMB_COMPLETION_SNAKR_Pos              (16)                                           /**< (SMB_COMPLETION) If this bit is 1, the Slave state machine sent a NACK to the transmitting Master while the Slave was receiving data from the SMBus interface. Position */
#define SMB_COMPLETION_SNAKR_Msk              (0x1U << SMB_COMPLETION_SNAKR_Pos)             /**< (SMB_COMPLETION) If this bit is 1, the Slave state machine sent a NACK to the transmitting Master while the Slave was receiving data from the SMBus interface. Mask */
#define SMB_COMPLETION_STR_Pos                (17)                                           /**< (SMB_COMPLETION) 0: Slave has just finished the receive phase of a transaction. \n                1: Slave has just finished the transmit phase of a transaction. Position */
#define SMB_COMPLETION_STR_Msk                (0x1U << SMB_COMPLETION_STR_Pos)               /**< (SMB_COMPLETION) 0: Slave has just finished the receive phase of a transaction. \n                1: Slave has just finished the transmit phase of a transaction. Mask */
#define SMB_COMPLETION_SPROT_Pos              (19)                                           /**< (SMB_COMPLETION) If this bit is 1, the WriteCount[7:0] counter in the Slave state machine either counted down to 0 before the Master sent a NACK signal, or the Slave received a NACK signal before the counter reached 0. Position */
#define SMB_COMPLETION_SPROT_Msk              (0x1U << SMB_COMPLETION_SPROT_Pos)             /**< (SMB_COMPLETION) If this bit is 1, the WriteCount[7:0] counter in the Slave state machine either counted down to 0 before the Master sent a NACK signal, or the Slave received a NACK signal before the counter reached 0. Mask */
#define SMB_COMPLETION_REPEAT_READ_Pos        (20)                                           /**< (SMB_COMPLETION) If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 1, indicating that the Master requested a Read operation. Position */
#define SMB_COMPLETION_REPEAT_READ_Msk        (0x1U << SMB_COMPLETION_REPEAT_READ_Pos)       /**< (SMB_COMPLETION) If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 1, indicating that the Master requested a Read operation. Mask */
#define SMB_COMPLETION_REPEAT_WRITE_Pos       (21)                                           /**< (SMB_COMPLETION) If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 0, indicating that the Master requested a Write operation. Position */
#define SMB_COMPLETION_REPEAT_WRITE_Msk       (0x1U << SMB_COMPLETION_REPEAT_WRITE_Pos)      /**< (SMB_COMPLETION) If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 0, indicating that the Master requested a Write operation. Mask */
#define SMB_COMPLETION_MNAKX_Pos              (24)                                           /**< (SMB_COMPLETION) If this bit is 1, the Master state machine received a NACK from the receiving Slave while the Master was transmitting data over the SMBus interface. (R/WC) Position */
#define SMB_COMPLETION_MNAKX_Msk              (0x1U << SMB_COMPLETION_MNAKX_Pos)             /**< (SMB_COMPLETION) If this bit is 1, the Master state machine received a NACK from the receiving Slave while the Master was transmitting data over the SMBus interface. (R/WC) Mask */
#define SMB_COMPLETION_MTR_Pos                (25)                                           /**< (SMB_COMPLETION) 0: Master has just finished the receive phase of a transaction. \n                1: Master has just finished the transmit phase of a transaction. Position */
#define SMB_COMPLETION_MTR_Msk                (0x1U << SMB_COMPLETION_MTR_Pos)               /**< (SMB_COMPLETION) 0: Master has just finished the receive phase of a transaction. \n                1: Master has just finished the transmit phase of a transaction. Mask */
#define SMB_COMPLETION_IDLE_Pos               (29)                                           /**< (SMB_COMPLETION) This bit is set when the I2C bus becomes idle (on the rising edge of nBB). (R/WC) Position */
#define SMB_COMPLETION_IDLE_Msk               (0x1U << SMB_COMPLETION_IDLE_Pos)              /**< (SMB_COMPLETION) This bit is set when the I2C bus becomes idle (on the rising edge of nBB). (R/WC) Mask */
#define SMB_COMPLETION_MDONE_Pos              (30)                                           /**< (SMB_COMPLETION) If this bit is 1, Master State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect. (R/WC) Position */
#define SMB_COMPLETION_MDONE_Msk              (0x1U << SMB_COMPLETION_MDONE_Pos)             /**< (SMB_COMPLETION) If this bit is 1, Master State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect. (R/WC) Mask */
#define SMB_COMPLETION_SDONE_Pos              (31)                                           /**< (SMB_COMPLETION) If this bit is 1, Slave State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect.(R/WC) Position */
#define SMB_COMPLETION_SDONE_Msk              (0x1U << SMB_COMPLETION_SDONE_Pos)             /**< (SMB_COMPLETION) If this bit is 1, Slave State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect.(R/WC) Mask */
#define SMB_COMPLETION_Msk                    (0xE33B7F7CUL)                                 /**< (SMB_COMPLETION) Register Mask  */

