ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/* -------- SMB_IDLE_SCALING : (SMB Offset: 0x24) (R/W 32) Idle Scaling Register -------- */

typedef union
{
  struct
  {
    uint32_t FAIR_BUS_IDLE_MIN:12;      /**< bit:  0..11  This field defines the number of ticks of the baud clock required to satisfy the fairness protocol. The default value for this field sets the idle window to 31us, which is the appropriate value for a 100 KHz bus */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t FAIR_IDLE_DELAY:12;        /**< bit: 16..27  This field defines the number of ticks of the baud clock required to program the delay. The default value for this field sets the delay period to 32us, which is the appropriate value for a 100 KHz bus */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_IDLE_SCALING_bits_t;
#define SMB_IDLE_SCALING_RESETVALUE         (0x1FC01EDU)                                  /**<  (SMB_IDLE_SCALING) Idle Scaling Register  Reset Value */

#define SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN_Pos (0)                                            /**< (SMB_IDLE_SCALING) This field defines the number of ticks of the baud clock required to satisfy the fairness protocol. The default value for this field sets the idle window to 31us, which is the appropriate value for a 100 KHz bus Position */
#define SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN_Msk (0xFFFU << SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN_Pos)  /**< (SMB_IDLE_SCALING) This field defines the number of ticks of the baud clock required to satisfy the fairness protocol. The default value for this field sets the idle window to 31us, which is the appropriate value for a 100 KHz bus Mask */
#define SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN(value) (SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN_Msk & ((value) << SMB_IDLE_SCALING_FAIR_BUS_IDLE_MIN_Pos))
#define SMB_IDLE_SCALING_FAIR_IDLE_DELAY_Pos  (16)                                           /**< (SMB_IDLE_SCALING) This field defines the number of ticks of the baud clock required to program the delay. The default value for this field sets the delay period to 32us, which is the appropriate value for a 100 KHz bus Position */
#define SMB_IDLE_SCALING_FAIR_IDLE_DELAY_Msk  (0xFFFU << SMB_IDLE_SCALING_FAIR_IDLE_DELAY_Pos)  /**< (SMB_IDLE_SCALING) This field defines the number of ticks of the baud clock required to program the delay. The default value for this field sets the delay period to 32us, which is the appropriate value for a 100 KHz bus Mask */
#define SMB_IDLE_SCALING_FAIR_IDLE_DELAY(value) (SMB_IDLE_SCALING_FAIR_IDLE_DELAY_Msk & ((value) << SMB_IDLE_SCALING_FAIR_IDLE_DELAY_Pos))
#define SMB_IDLE_SCALING_Msk                  (0x0FFF0FFFUL)                                 /**< (SMB_IDLE_SCALING) Register Mask  */

/* -------- SMB_CONFIGURATION : (SMB Offset: 0x28) (R/W 32) Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t PORT_SEL:4;                /**< bit:   0..3  The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. */
    uint32_t TCEN:1;                    /**< bit:      4  When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled */
    uint32_t SLOW_CLOCK:1;              /**< bit:      5  When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. */
    uint32_t TEST:1;                    /**< bit:      6  Must be always written with 0.                */
    uint32_t PECEN:1;                   /**< bit:      7  When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled */
    uint32_t FEN:1;                     /**< bit:      8  Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. */
    uint32_t RESET:1;                   /**< bit:      9  When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. */
    uint32_t ENAB:1;                    /**< bit:     10  When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. */
    uint32_t DSA:1;                     /**< bit:     11  0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode */
    uint32_t FAIR:1;                    /**< bit:     12  If this bit is 1, the MCTP Fairness protocol is in effect. */
    uint32_t TEST0:1;                   /**< bit:     13  Must be always written with 0.                */
    uint32_t GC_DIS:1;                  /**< bit:     14  This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. */
    uint32_t CFG_PROMISCUOUS:1;         /**< bit:     15  This bit define the Mode of SM Bus Controler Mode of operation.         0= Normal Operation.         1=  Promiscuous Mode Enable. */
    uint32_t FLUSH_SXBUF:1;             /**< bit:     16  A write of a 1 to this bit forces the SMBus Slave Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. */
    uint32_t FLUSH_SRBUF:1;             /**< bit:     17  A write of a 1 to this bit forces the SMBus Slave Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. */
    uint32_t FLUSH_MXBUF:1;             /**< bit:     18  A write of a 1 to this bit forces the SMBus Master Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. */
    uint32_t FLUSH_MRBUF:1;             /**< bit:     19  A write of a 1 to this bit forces the SMBus Master Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. */
    uint32_t :8;                        /**< bit: 20..27  Reserved                                      */
    uint32_t EN_AAS:1;                  /**< bit:     28  0: Disable the AAS, 1: Enable the AAS Interrupt */
    uint32_t ENIDI:1;                   /**< bit:     29  If this bit is 1, the Idle interrupt is enabled. If this bit is 0, the Idle interrupt is disabled. */
    uint32_t ENMI:1;                    /**< bit:     30  If this bit is 1, the Master Done interrupt is enabled. If this bit is 0, the Master Done interrupt is disabled. */
    uint32_t ENSI:1;                    /**< bit:     31  If this bit is 1, the Slave Done interrupt is enabled. If this bit is 0, the Slave Done interrupt is disabled */
  };
  uint32_t w;
} __SMB_CONFIGURATION_bits_t;
#define SMB_CONFIGURATION_RESETVALUE        (0x00U)                                       /**<  (SMB_CONFIGURATION) Configuration Register  Reset Value */

