ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_CONFIGURATION_PORT_SEL_Pos        (0)                                            /**< (SMB_CONFIGURATION) The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. Position */
#define SMB_CONFIGURATION_PORT_SEL_Msk        (0xFU << SMB_CONFIGURATION_PORT_SEL_Pos)       /**< (SMB_CONFIGURATION) The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. Mask */
#define SMB_CONFIGURATION_PORT_SEL(value)     (SMB_CONFIGURATION_PORT_SEL_Msk & ((value) << SMB_CONFIGURATION_PORT_SEL_Pos))
#define SMB_CONFIGURATION_TCEN_Pos            (4)                                            /**< (SMB_CONFIGURATION) When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled Position */
#define SMB_CONFIGURATION_TCEN_Msk            (0x1U << SMB_CONFIGURATION_TCEN_Pos)           /**< (SMB_CONFIGURATION) When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled Mask */
#define SMB_CONFIGURATION_SLOW_CLOCK_Pos      (5)                                            /**< (SMB_CONFIGURATION) When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. Position */
#define SMB_CONFIGURATION_SLOW_CLOCK_Msk      (0x1U << SMB_CONFIGURATION_SLOW_CLOCK_Pos)     /**< (SMB_CONFIGURATION) When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. Mask */
#define SMB_CONFIGURATION_TEST_Pos            (6)                                            /**< (SMB_CONFIGURATION) Must be always written with 0. Position */
#define SMB_CONFIGURATION_TEST_Msk            (0x1U << SMB_CONFIGURATION_TEST_Pos)           /**< (SMB_CONFIGURATION) Must be always written with 0. Mask */
#define SMB_CONFIGURATION_PECEN_Pos           (7)                                            /**< (SMB_CONFIGURATION) When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled Position */
#define SMB_CONFIGURATION_PECEN_Msk           (0x1U << SMB_CONFIGURATION_PECEN_Pos)          /**< (SMB_CONFIGURATION) When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled Mask */
#define SMB_CONFIGURATION_FEN_Pos             (8)                                            /**< (SMB_CONFIGURATION) Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. Position */
#define SMB_CONFIGURATION_FEN_Msk             (0x1U << SMB_CONFIGURATION_FEN_Pos)            /**< (SMB_CONFIGURATION) Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. Mask */
#define SMB_CONFIGURATION_RESET_Pos           (9)                                            /**< (SMB_CONFIGURATION) When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. Position */
#define SMB_CONFIGURATION_RESET_Msk           (0x1U << SMB_CONFIGURATION_RESET_Pos)          /**< (SMB_CONFIGURATION) When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. Mask */
#define SMB_CONFIGURATION_ENAB_Pos            (10)                                           /**< (SMB_CONFIGURATION) When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. Position */
#define SMB_CONFIGURATION_ENAB_Msk            (0x1U << SMB_CONFIGURATION_ENAB_Pos)           /**< (SMB_CONFIGURATION) When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. Mask */
#define SMB_CONFIGURATION_DSA_Pos             (11)                                           /**< (SMB_CONFIGURATION) 0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode Position */
#define SMB_CONFIGURATION_DSA_Msk             (0x1U << SMB_CONFIGURATION_DSA_Pos)            /**< (SMB_CONFIGURATION) 0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode Mask */
#define SMB_CONFIGURATION_FAIR_Pos            (12)                                           /**< (SMB_CONFIGURATION) If this bit is 1, the MCTP Fairness protocol is in effect. Position */
#define SMB_CONFIGURATION_FAIR_Msk            (0x1U << SMB_CONFIGURATION_FAIR_Pos)           /**< (SMB_CONFIGURATION) If this bit is 1, the MCTP Fairness protocol is in effect. Mask */
#define SMB_CONFIGURATION_TEST0_Pos           (13)                                           /**< (SMB_CONFIGURATION) Must be always written with 0. Position */
#define SMB_CONFIGURATION_TEST0_Msk           (0x1U << SMB_CONFIGURATION_TEST0_Pos)          /**< (SMB_CONFIGURATION) Must be always written with 0. Mask */
#define SMB_CONFIGURATION_GC_DIS_Pos          (14)                                           /**< (SMB_CONFIGURATION) This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. Position */
#define SMB_CONFIGURATION_GC_DIS_Msk          (0x1U << SMB_CONFIGURATION_GC_DIS_Pos)         /**< (SMB_CONFIGURATION) This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. Mask */
#define SMB_CONFIGURATION_CFG_PROMISCUOUS_Pos (15)                                           /**< (SMB_CONFIGURATION) This bit define the Mode of SM Bus Controler Mode of operation.         0= Normal Operation.         1=  Promiscuous Mode Enable. Position */
#define SMB_CONFIGURATION_CFG_PROMISCUOUS_Msk (0x1U << SMB_CONFIGURATION_CFG_PROMISCUOUS_Pos)  /**< (SMB_CONFIGURATION) This bit define the Mode of SM Bus Controler Mode of operation.         0= Normal Operation.         1=  Promiscuous Mode Enable. Mask */
#define SMB_CONFIGURATION_FLUSH_SXBUF_Pos     (16)                                           /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Slave Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Position */
#define SMB_CONFIGURATION_FLUSH_SXBUF_Msk     (0x1U << SMB_CONFIGURATION_FLUSH_SXBUF_Pos)    /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Slave Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Mask */
#define SMB_CONFIGURATION_FLUSH_SRBUF_Pos     (17)                                           /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Slave Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Position */
#define SMB_CONFIGURATION_FLUSH_SRBUF_Msk     (0x1U << SMB_CONFIGURATION_FLUSH_SRBUF_Pos)    /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Slave Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Mask */
#define SMB_CONFIGURATION_FLUSH_MXBUF_Pos     (18)                                           /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Master Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Position */
#define SMB_CONFIGURATION_FLUSH_MXBUF_Msk     (0x1U << SMB_CONFIGURATION_FLUSH_MXBUF_Pos)    /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Master Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Mask */
#define SMB_CONFIGURATION_FLUSH_MRBUF_Pos     (19)                                           /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Master Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Position */
#define SMB_CONFIGURATION_FLUSH_MRBUF_Msk     (0x1U << SMB_CONFIGURATION_FLUSH_MRBUF_Pos)    /**< (SMB_CONFIGURATION) A write of a 1 to this bit forces the SMBus Master Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit. Mask */
#define SMB_CONFIGURATION_EN_AAS_Pos          (28)                                           /**< (SMB_CONFIGURATION) 0: Disable the AAS, 1: Enable the AAS Interrupt Position */
#define SMB_CONFIGURATION_EN_AAS_Msk          (0x1U << SMB_CONFIGURATION_EN_AAS_Pos)         /**< (SMB_CONFIGURATION) 0: Disable the AAS, 1: Enable the AAS Interrupt Mask */
#define SMB_CONFIGURATION_ENIDI_Pos           (29)                                           /**< (SMB_CONFIGURATION) If this bit is 1, the Idle interrupt is enabled. If this bit is 0, the Idle interrupt is disabled. Position */
#define SMB_CONFIGURATION_ENIDI_Msk           (0x1U << SMB_CONFIGURATION_ENIDI_Pos)          /**< (SMB_CONFIGURATION) If this bit is 1, the Idle interrupt is enabled. If this bit is 0, the Idle interrupt is disabled. Mask */
#define SMB_CONFIGURATION_ENMI_Pos            (30)                                           /**< (SMB_CONFIGURATION) If this bit is 1, the Master Done interrupt is enabled. If this bit is 0, the Master Done interrupt is disabled. Position */
#define SMB_CONFIGURATION_ENMI_Msk            (0x1U << SMB_CONFIGURATION_ENMI_Pos)           /**< (SMB_CONFIGURATION) If this bit is 1, the Master Done interrupt is enabled. If this bit is 0, the Master Done interrupt is disabled. Mask */
#define SMB_CONFIGURATION_ENSI_Pos            (31)                                           /**< (SMB_CONFIGURATION) If this bit is 1, the Slave Done interrupt is enabled. If this bit is 0, the Slave Done interrupt is disabled Position */
#define SMB_CONFIGURATION_ENSI_Msk            (0x1U << SMB_CONFIGURATION_ENSI_Pos)           /**< (SMB_CONFIGURATION) If this bit is 1, the Slave Done interrupt is enabled. If this bit is 0, the Slave Done interrupt is disabled Mask */
#define SMB_CONFIGURATION_Msk                 (0xF00FFFFFUL)                                 /**< (SMB_CONFIGURATION) Register Mask  */

