ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/* -------- SMB_BUS_CLOCK : (SMB Offset: 0x2c) (R/W 32) Bus Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t LOW_PERIOD:8;              /**< bit:   0..7  This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. */
    uint32_t HIGH_PERIOD:8;             /**< bit:  8..15  This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_BUS_CLOCK_bits_t;
#define SMB_BUS_CLOCK_RESETVALUE            (0x4F4FU)                                     /**<  (SMB_BUS_CLOCK) Bus Clock Register  Reset Value */

#define SMB_BUS_CLOCK_LOW_PERIOD_Pos          (0)                                            /**< (SMB_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. Position */
#define SMB_BUS_CLOCK_LOW_PERIOD_Msk          (0xFFU << SMB_BUS_CLOCK_LOW_PERIOD_Pos)        /**< (SMB_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. Mask */
#define SMB_BUS_CLOCK_LOW_PERIOD(value)       (SMB_BUS_CLOCK_LOW_PERIOD_Msk & ((value) << SMB_BUS_CLOCK_LOW_PERIOD_Pos))
#define SMB_BUS_CLOCK_HIGH_PERIOD_Pos         (8)                                            /**< (SMB_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. Position */
#define SMB_BUS_CLOCK_HIGH_PERIOD_Msk         (0xFFU << SMB_BUS_CLOCK_HIGH_PERIOD_Pos)       /**< (SMB_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. Mask */
#define SMB_BUS_CLOCK_HIGH_PERIOD(value)      (SMB_BUS_CLOCK_HIGH_PERIOD_Msk & ((value) << SMB_BUS_CLOCK_HIGH_PERIOD_Pos))
#define SMB_BUS_CLOCK_Msk                     (0x0000FFFFUL)                                 /**< (SMB_BUS_CLOCK) Register Mask  */

/* -------- SMB_BLOCK_ID : (SMB Offset: 0x30) (R/ 8) Block ID Register -------- */

typedef union
{
  struct
  {
    uint8_t  ID:8;                      /**< bit:   0..7  Block ID.                                     */
  };
  uint8_t  w;
} __SMB_BLOCK_ID_bits_t;
#define SMB_BLOCK_ID_RESETVALUE             (0x00U)                                       /**<  (SMB_BLOCK_ID) Block ID Register  Reset Value */

#define SMB_BLOCK_ID_ID_Pos                   (0)                                            /**< (SMB_BLOCK_ID) Block ID. Position */
#define SMB_BLOCK_ID_ID_Msk                   (0xFFU << SMB_BLOCK_ID_ID_Pos)                 /**< (SMB_BLOCK_ID) Block ID. Mask */
#define SMB_BLOCK_ID_ID(value)                (SMB_BLOCK_ID_ID_Msk & ((value) << SMB_BLOCK_ID_ID_Pos))
#define SMB_BLOCK_ID_Msk                      (0x000000FFUL)                                 /**< (SMB_BLOCK_ID) Register Mask  */

/* -------- SMB_REVISION : (SMB Offset: 0x34) (R/ 8) Revision Register -------- */

typedef union
{
  struct
  {
    uint8_t  REVISION:8;                /**< bit:   0..7  Block Revision Number                         */
  };
  uint8_t  w;
} __SMB_REVISION_bits_t;
#define SMB_REVISION_RESETVALUE             (0x00U)                                       /**<  (SMB_REVISION) Revision Register  Reset Value */

#define SMB_REVISION_REVISION_Pos             (0)                                            /**< (SMB_REVISION) Block Revision Number Position */
#define SMB_REVISION_REVISION_Msk             (0xFFU << SMB_REVISION_REVISION_Pos)           /**< (SMB_REVISION) Block Revision Number Mask */
#define SMB_REVISION_REVISION(value)          (SMB_REVISION_REVISION_Msk & ((value) << SMB_REVISION_REVISION_Pos))
#define SMB_REVISION_Msk                      (0x000000FFUL)                                 /**< (SMB_REVISION) Register Mask  */

/* -------- SMB_BIT_BANG_CONTROL : (SMB Offset: 0x38) (R/W 32) Bit-Bang Control Register -------- */

typedef union
{
  struct
  {
    uint32_t BBEN:1;                    /**< bit:      0  Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled */
    uint32_t CLDIR:1;                   /**< bit:      1  Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output */
    uint32_t DADIR:1;                   /**< bit:      2  Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output */
    uint32_t BBCLK:1;                   /**< bit:      3  Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' */
    uint32_t BBDAT:1;                   /**< bit:      4  Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' */
    uint32_t BBCLKI:1;                  /**< bit:      5  Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. */
    uint32_t BBDATI:1;                  /**< bit:      6  Bit-Bang Data In. The BBDATI bit always returns the state of SDAT */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_BIT_BANG_CONTROL_bits_t;
#define SMB_BIT_BANG_CONTROL_RESETVALUE     (0x60U)                                       /**<  (SMB_BIT_BANG_CONTROL) Bit-Bang Control Register  Reset Value */

#define SMB_BIT_BANG_CONTROL_BBEN_Pos         (0)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled Position */
#define SMB_BIT_BANG_CONTROL_BBEN_Msk         (0x1U << SMB_BIT_BANG_CONTROL_BBEN_Pos)        /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled Mask */
#define SMB_BIT_BANG_CONTROL_CLDIR_Pos        (1)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output Position */
#define SMB_BIT_BANG_CONTROL_CLDIR_Msk        (0x1U << SMB_BIT_BANG_CONTROL_CLDIR_Pos)       /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output Mask */
#define SMB_BIT_BANG_CONTROL_DADIR_Pos        (2)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output Position */
#define SMB_BIT_BANG_CONTROL_DADIR_Msk        (0x1U << SMB_BIT_BANG_CONTROL_DADIR_Pos)       /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output Mask */
#define SMB_BIT_BANG_CONTROL_BBCLK_Pos        (3)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' Position */
#define SMB_BIT_BANG_CONTROL_BBCLK_Msk        (0x1U << SMB_BIT_BANG_CONTROL_BBCLK_Pos)       /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' Mask */
#define SMB_BIT_BANG_CONTROL_BBDAT_Pos        (4)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' Position */
#define SMB_BIT_BANG_CONTROL_BBDAT_Msk        (0x1U << SMB_BIT_BANG_CONTROL_BBDAT_Pos)       /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' Mask */
#define SMB_BIT_BANG_CONTROL_BBCLKI_Pos       (5)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. Position */
#define SMB_BIT_BANG_CONTROL_BBCLKI_Msk       (0x1U << SMB_BIT_BANG_CONTROL_BBCLKI_Pos)      /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. Mask */
#define SMB_BIT_BANG_CONTROL_BBDATI_Pos       (6)                                            /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data In. The BBDATI bit always returns the state of SDAT Position */
#define SMB_BIT_BANG_CONTROL_BBDATI_Msk       (0x1U << SMB_BIT_BANG_CONTROL_BBDATI_Pos)      /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Data In. The BBDATI bit always returns the state of SDAT Mask */
#define SMB_BIT_BANG_CONTROL_Msk              (0x0000007FUL)                                 /**< (SMB_BIT_BANG_CONTROL) Register Mask  */

/* -------- SMB_TEST : (SMB Offset: 0x3c) (R/ 8) Test -------- */

typedef union
{
  struct
  {
    uint8_t  TEST:8;                    /**< bit:   0..7  This register must not be written, or undesirable results may occur. */
  };
  uint8_t  w;
} __SMB_TEST_bits_t;
#define SMB_TEST_RESETVALUE                 (0x00U)                                       /**<  (SMB_TEST) Test  Reset Value */

