ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_TEST_TEST_Pos                     (0)                                            /**< (SMB_TEST) This register must not be written, or undesirable results may occur. Position */
#define SMB_TEST_TEST_Msk                     (0xFFU << SMB_TEST_TEST_Pos)                   /**< (SMB_TEST) This register must not be written, or undesirable results may occur. Mask */
#define SMB_TEST_TEST(value)                  (SMB_TEST_TEST_Msk & ((value) << SMB_TEST_TEST_Pos))
#define SMB_TEST_Msk                          (0x000000FFUL)                                 /**< (SMB_TEST) Register Mask  */

/* -------- SMB_DATA_TIMING : (SMB Offset: 0x40) (R/W 32) Data Timing Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA_HOLD:8;               /**< bit:   0..7  The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. */
    uint32_t RESTART_SETUP:8;           /**< bit:  8..15  The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. */
    uint32_t STOP_SETUP:8;              /**< bit: 16..23  The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. */
    uint32_t FIRST_START_HOLD:8;        /**< bit: 24..31  This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. */
  };
  uint32_t w;
} __SMB_DATA_TIMING_bits_t;
#define SMB_DATA_TIMING_RESETVALUE          (0xC4D5006U)                                  /**<  (SMB_DATA_TIMING) Data Timing Register  Reset Value */

#define SMB_DATA_TIMING_DATA_HOLD_Pos         (0)                                            /**< (SMB_DATA_TIMING) The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. Position */
#define SMB_DATA_TIMING_DATA_HOLD_Msk         (0xFFU << SMB_DATA_TIMING_DATA_HOLD_Pos)       /**< (SMB_DATA_TIMING) The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. Mask */
#define SMB_DATA_TIMING_DATA_HOLD(value)      (SMB_DATA_TIMING_DATA_HOLD_Msk & ((value) << SMB_DATA_TIMING_DATA_HOLD_Pos))
#define SMB_DATA_TIMING_RESTART_SETUP_Pos     (8)                                            /**< (SMB_DATA_TIMING) The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. Position */
#define SMB_DATA_TIMING_RESTART_SETUP_Msk     (0xFFU << SMB_DATA_TIMING_RESTART_SETUP_Pos)   /**< (SMB_DATA_TIMING) The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. Mask */
#define SMB_DATA_TIMING_RESTART_SETUP(value)  (SMB_DATA_TIMING_RESTART_SETUP_Msk & ((value) << SMB_DATA_TIMING_RESTART_SETUP_Pos))
#define SMB_DATA_TIMING_STOP_SETUP_Pos        (16)                                           /**< (SMB_DATA_TIMING) The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. Position */
#define SMB_DATA_TIMING_STOP_SETUP_Msk        (0xFFU << SMB_DATA_TIMING_STOP_SETUP_Pos)      /**< (SMB_DATA_TIMING) The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. Mask */
#define SMB_DATA_TIMING_STOP_SETUP(value)     (SMB_DATA_TIMING_STOP_SETUP_Msk & ((value) << SMB_DATA_TIMING_STOP_SETUP_Pos))
#define SMB_DATA_TIMING_FIRST_START_HOLD_Pos  (24)                                           /**< (SMB_DATA_TIMING) This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. Position */
#define SMB_DATA_TIMING_FIRST_START_HOLD_Msk  (0xFFU << SMB_DATA_TIMING_FIRST_START_HOLD_Pos)  /**< (SMB_DATA_TIMING) This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. Mask */
#define SMB_DATA_TIMING_FIRST_START_HOLD(value) (SMB_DATA_TIMING_FIRST_START_HOLD_Msk & ((value) << SMB_DATA_TIMING_FIRST_START_HOLD_Pos))
#define SMB_DATA_TIMING_Msk                   (0xFFFFFFFFUL)                                 /**< (SMB_DATA_TIMING) Register Mask  */

/* -------- SMB_TIME_OUT_SCALING : (SMB Offset: 0x44) (R/W 32) Time-Out Scaling Register -------- */

typedef union
{
  struct
  {
    uint32_t CLOCK_HIGH_TIME_OUT:8;     /**< bit:   0..7  Clock High time out period = Clock High Time-Out [7:0] x Baud_Clock_Period x 2 */
    uint32_t SLAVE_CUM_TIME_OUT:8;      /**< bit:  8..15  Slave Cumulative Time-Out duration = Slave Cum Time-Out [7:0] x Baud_Clock_Period x 1024 */
    uint32_t MASTER_CUM_TIME_OUT:8;     /**< bit: 16..23  Master Cumulative Time-Out duration = Master Cum Time-Out [7:0] x Baud_Clock_Period x 512 */
    uint32_t BUS_IDLE_MIN:8;            /**< bit: 24..31  Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period */
  };
  uint32_t w;
} __SMB_TIME_OUT_SCALING_bits_t;
#define SMB_TIME_OUT_SCALING_RESETVALUE     (0x4B9CC2C7U)                                 /**<  (SMB_TIME_OUT_SCALING) Time-Out Scaling Register  Reset Value */

#define SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT_Pos (0)                                            /**< (SMB_TIME_OUT_SCALING) Clock High time out period = Clock High Time-Out [7:0] x Baud_Clock_Period x 2 Position */
#define SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT_Msk (0xFFU << SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT_Pos)  /**< (SMB_TIME_OUT_SCALING) Clock High time out period = Clock High Time-Out [7:0] x Baud_Clock_Period x 2 Mask */
#define SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT(value) (SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT_Msk & ((value) << SMB_TIME_OUT_SCALING_CLOCK_HIGH_TIME_OUT_Pos))
#define SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT_Pos (8)                                            /**< (SMB_TIME_OUT_SCALING) Slave Cumulative Time-Out duration = Slave Cum Time-Out [7:0] x Baud_Clock_Period x 1024 Position */
#define SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT_Msk (0xFFU << SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT_Pos)  /**< (SMB_TIME_OUT_SCALING) Slave Cumulative Time-Out duration = Slave Cum Time-Out [7:0] x Baud_Clock_Period x 1024 Mask */
#define SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT(value) (SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT_Msk & ((value) << SMB_TIME_OUT_SCALING_SLAVE_CUM_TIME_OUT_Pos))
#define SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT_Pos (16)                                           /**< (SMB_TIME_OUT_SCALING) Master Cumulative Time-Out duration = Master Cum Time-Out [7:0] x Baud_Clock_Period x 512 Position */
#define SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT_Msk (0xFFU << SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT_Pos)  /**< (SMB_TIME_OUT_SCALING) Master Cumulative Time-Out duration = Master Cum Time-Out [7:0] x Baud_Clock_Period x 512 Mask */
#define SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT(value) (SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT_Msk & ((value) << SMB_TIME_OUT_SCALING_MASTER_CUM_TIME_OUT_Pos))
#define SMB_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos (24)                                           /**< (SMB_TIME_OUT_SCALING) Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period Position */
#define SMB_TIME_OUT_SCALING_BUS_IDLE_MIN_Msk (0xFFU << SMB_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos)  /**< (SMB_TIME_OUT_SCALING) Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period Mask */
#define SMB_TIME_OUT_SCALING_BUS_IDLE_MIN(value) (SMB_TIME_OUT_SCALING_BUS_IDLE_MIN_Msk & ((value) << SMB_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos))
#define SMB_TIME_OUT_SCALING_Msk              (0xFFFFFFFFUL)                                 /**< (SMB_TIME_OUT_SCALING) Register Mask  */

