ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/* -------- SMB_SLAVE_TRANSMIT_BUFFER : (SMB Offset: 0x48) (R/W 32) SMBus Slave Transmit Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t SLAVE_TRANSMIT_BUFFER:8;   /**< bit:   0..7  SLAVE_TRANSMIT_BUFFER                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_SLAVE_TRANSMIT_BUFFER_bits_t;
#define SMB_SLAVE_TRANSMIT_BUFFER_RESETVALUE (0x00U)                                       /**<  (SMB_SLAVE_TRANSMIT_BUFFER) SMBus Slave Transmit Buffer Register  Reset Value */

#define SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER_Pos (0)                                            /**< (SMB_SLAVE_TRANSMIT_BUFFER) SLAVE_TRANSMIT_BUFFER Position */
#define SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER_Msk (0xFFU << SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER_Pos)  /**< (SMB_SLAVE_TRANSMIT_BUFFER) SLAVE_TRANSMIT_BUFFER Mask */
#define SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER(value) (SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER_Msk & ((value) << SMB_SLAVE_TRANSMIT_BUFFER_SLAVE_TRANSMIT_BUFFER_Pos))
#define SMB_SLAVE_TRANSMIT_BUFFER_Msk         (0x000000FFUL)                                 /**< (SMB_SLAVE_TRANSMIT_BUFFER) Register Mask  */

/* -------- SMB_SLAVE_RECEIVE_BUFFER : (SMB Offset: 0x4c) (R/W 32) SMBus Slave Receive Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t SLAVE_RECEIVE_BUFFER:8;    /**< bit:   0..7  SLAVE_RECEIVE_BUFFER                          */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_SLAVE_RECEIVE_BUFFER_bits_t;
#define SMB_SLAVE_RECEIVE_BUFFER_RESETVALUE (0x00U)                                       /**<  (SMB_SLAVE_RECEIVE_BUFFER) SMBus Slave Receive Buffer Register  Reset Value */

#define SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER_Pos (0)                                            /**< (SMB_SLAVE_RECEIVE_BUFFER) SLAVE_RECEIVE_BUFFER Position */
#define SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER_Msk (0xFFU << SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER_Pos)  /**< (SMB_SLAVE_RECEIVE_BUFFER) SLAVE_RECEIVE_BUFFER Mask */
#define SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER(value) (SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER_Msk & ((value) << SMB_SLAVE_RECEIVE_BUFFER_SLAVE_RECEIVE_BUFFER_Pos))
#define SMB_SLAVE_RECEIVE_BUFFER_Msk          (0x000000FFUL)                                 /**< (SMB_SLAVE_RECEIVE_BUFFER) Register Mask  */

/* -------- SMB_MASTER_TRANSMIT_BUFER : (SMB Offset: 0x50) (R/W 32) SMBus Master Transmit Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t MASTER_TRANSMIT_BUFFER:8;  /**< bit:   0..7  MASTER_TRANSMIT_BUFFER                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_MASTER_TRANSMIT_BUFER_bits_t;
#define SMB_MASTER_TRANSMIT_BUFER_RESETVALUE (0x00U)                                       /**<  (SMB_MASTER_TRANSMIT_BUFER) SMBus Master Transmit Buffer Register  Reset Value */

#define SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER_Pos (0)                                            /**< (SMB_MASTER_TRANSMIT_BUFER) MASTER_TRANSMIT_BUFFER Position */
#define SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER_Msk (0xFFU << SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER_Pos)  /**< (SMB_MASTER_TRANSMIT_BUFER) MASTER_TRANSMIT_BUFFER Mask */
#define SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER(value) (SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER_Msk & ((value) << SMB_MASTER_TRANSMIT_BUFER_MASTER_TRANSMIT_BUFFER_Pos))
#define SMB_MASTER_TRANSMIT_BUFER_Msk         (0x000000FFUL)                                 /**< (SMB_MASTER_TRANSMIT_BUFER) Register Mask  */

/* -------- SMB_MASTER_RECEIVE_BUFFER : (SMB Offset: 0x54) (R/W 32) SMBus Master Receive Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t MASTER_RECEIVE_BUFFER:8;   /**< bit:   0..7  MASTER_RECEIVE_BUFFER                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_MASTER_RECEIVE_BUFFER_bits_t;
#define SMB_MASTER_RECEIVE_BUFFER_RESETVALUE (0x00U)                                       /**<  (SMB_MASTER_RECEIVE_BUFFER) SMBus Master Receive Buffer Register  Reset Value */

#define SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER_Pos (0)                                            /**< (SMB_MASTER_RECEIVE_BUFFER) MASTER_RECEIVE_BUFFER Position */
#define SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER_Msk (0xFFU << SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER_Pos)  /**< (SMB_MASTER_RECEIVE_BUFFER) MASTER_RECEIVE_BUFFER Mask */
#define SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER(value) (SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER_Msk & ((value) << SMB_MASTER_RECEIVE_BUFFER_MASTER_RECEIVE_BUFFER_Pos))
#define SMB_MASTER_RECEIVE_BUFFER_Msk         (0x000000FFUL)                                 /**< (SMB_MASTER_RECEIVE_BUFFER) Register Mask  */

/* -------- SMB_WAKE_STATUS : (SMB Offset: 0x60) (R/W 32) WAKE STATUS Register -------- */

typedef union
{
  struct
  {
    uint32_t START_BIT_DETECTION:1;     /**< bit:      0  This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_WAKE_STATUS_bits_t;
#define SMB_WAKE_STATUS_RESETVALUE          (0x00U)                                       /**<  (SMB_WAKE_STATUS) WAKE STATUS Register  Reset Value */

#define SMB_WAKE_STATUS_START_BIT_DETECTION_Pos (0)                                            /**< (SMB_WAKE_STATUS) This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) Position */
#define SMB_WAKE_STATUS_START_BIT_DETECTION_Msk (0x1U << SMB_WAKE_STATUS_START_BIT_DETECTION_Pos)  /**< (SMB_WAKE_STATUS) This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) Mask */
#define SMB_WAKE_STATUS_Msk                   (0x00000001UL)                                 /**< (SMB_WAKE_STATUS) Register Mask  */

