ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
/* -------- SMB_WAKE_ENABLE : (SMB Offset: 0x64) (R/W 32) WAKE ENABLE Register -------- */

typedef union
{
  struct
  {
    uint32_t START_DETECT_INT_EN:1;     /**< bit:      0  Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n      1=Start Bit Detection Interrupt enabled; 0=Start Bit Detection Interrupt disabled */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SMB_WAKE_ENABLE_bits_t;
#define SMB_WAKE_ENABLE_RESETVALUE          (0x00U)                                       /**<  (SMB_WAKE_ENABLE) WAKE ENABLE Register  Reset Value */

#define SMB_WAKE_ENABLE_START_DETECT_INT_EN_Pos (0)                                            /**< (SMB_WAKE_ENABLE) Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n      1=Start Bit Detection Interrupt enabled; 0=Start Bit Detection Interrupt disabled Position */
#define SMB_WAKE_ENABLE_START_DETECT_INT_EN_Msk (0x1U << SMB_WAKE_ENABLE_START_DETECT_INT_EN_Pos)  /**< (SMB_WAKE_ENABLE) Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n      1=Start Bit Detection Interrupt enabled; 0=Start Bit Detection Interrupt disabled Mask */
#define SMB_WAKE_ENABLE_Msk                   (0x00000001UL)                                 /**< (SMB_WAKE_ENABLE) Register Mask  */

/* -------- SMB_SLAVE_ADDRESS : (SMB Offset: 0x6c) (R/W 8) This is the Slave Address Register -------- */

typedef union
{
  struct
  {
    uint8_t  SLAVEADD:8;                /**< bit:   0..7  This register stores value of address + LSB direction after the 8th clock of the Address Byte.\n */
  };
  uint8_t  w;
} __SMB_SLAVE_ADDRESS_bits_t;
#define SMB_SLAVE_ADDRESS_RESETVALUE        (0x00U)                                       /**<  (SMB_SLAVE_ADDRESS) This is the Slave Address Register  Reset Value */

#define SMB_SLAVE_ADDRESS_SLAVEADD_Pos        (0)                                            /**< (SMB_SLAVE_ADDRESS) This register stores value of address + LSB direction after the 8th clock of the Address Byte.\n Position */
#define SMB_SLAVE_ADDRESS_SLAVEADD_Msk        (0xFFU << SMB_SLAVE_ADDRESS_SLAVEADD_Pos)      /**< (SMB_SLAVE_ADDRESS) This register stores value of address + LSB direction after the 8th clock of the Address Byte.\n Mask */
#define SMB_SLAVE_ADDRESS_SLAVEADD(value)     (SMB_SLAVE_ADDRESS_SLAVEADD_Msk & ((value) << SMB_SLAVE_ADDRESS_SLAVEADD_Pos))
#define SMB_SLAVE_ADDRESS_Msk                 (0x000000FFUL)                                 /**< (SMB_SLAVE_ADDRESS) Register Mask  */

/* -------- SMB_PROMISCUOUS_INT : (SMB Offset: 0x70) (R/W 8) This is the Promiscuous Interrupt Register -------- */

typedef union
{
  struct
  {
    uint8_t  PROMISCUOUS_ADDSTAT:1;     /**< bit:      0  This is the Promiscuous Address Status interrupt and is set on the 8th clock of the I2C Address.\n         This bit will hold the Clock line low till this register bit is cleared. This is Write 1 to clear.\n         R/W1C. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __SMB_PROMISCUOUS_INT_bits_t;
#define SMB_PROMISCUOUS_INT_RESETVALUE      (0x00U)                                       /**<  (SMB_PROMISCUOUS_INT) This is the Promiscuous Interrupt Register  Reset Value */

#define SMB_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Pos (0)                                            /**< (SMB_PROMISCUOUS_INT) This is the Promiscuous Address Status interrupt and is set on the 8th clock of the I2C Address.\n         This bit will hold the Clock line low till this register bit is cleared. This is Write 1 to clear.\n         R/W1C. Position */
#define SMB_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Msk (0x1U << SMB_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Pos)  /**< (SMB_PROMISCUOUS_INT) This is the Promiscuous Address Status interrupt and is set on the 8th clock of the I2C Address.\n         This bit will hold the Clock line low till this register bit is cleared. This is Write 1 to clear.\n         R/W1C. Mask */
#define SMB_PROMISCUOUS_INT_Msk               (0x00000001UL)                                 /**< (SMB_PROMISCUOUS_INT) Register Mask  */

/* -------- SMB_PROMIS_INTEN : (SMB Offset: 0x74) (R/W 8) This is the Promiscuous Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint8_t  PROMIS_ADDSTAT_INTEN:1;    /**< bit:      0  This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __SMB_PROMIS_INTEN_bits_t;
#define SMB_PROMIS_INTEN_RESETVALUE         (0x00U)                                       /**<  (SMB_PROMIS_INTEN) This is the Promiscuous Interrupt Enable Register  Reset Value */

#define SMB_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Pos (0)                                            /**< (SMB_PROMIS_INTEN) This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n Position */
#define SMB_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Msk (0x1U << SMB_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Pos)  /**< (SMB_PROMIS_INTEN) This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n Mask */
#define SMB_PROMIS_INTEN_Msk                  (0x00000001UL)                                 /**< (SMB_PROMIS_INTEN) Register Mask  */

/* -------- SMB_PROMIS_CTRL : (SMB Offset: 0x78) (R/W 8) This is the Promiscuous Control Register -------- */

typedef union
{
  struct
  {
    uint8_t  PROMIS_ACK_NAK:1;          /**< bit:      0  This is the Promiscuous ACK / NAK response register.\n         1= ACK. \n         0= NAK. \n */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __SMB_PROMIS_CTRL_bits_t;
