ranjithaguna/pv/LED_Demo/source/pic32cx/component/smb.h
#define SMB_PROMIS_CTRL_RESETVALUE          (0x00U)                                       /**<  (SMB_PROMIS_CTRL) This is the Promiscuous Control Register  Reset Value */

#define SMB_PROMIS_CTRL_PROMIS_ACK_NAK_Pos    (0)                                            /**< (SMB_PROMIS_CTRL) This is the Promiscuous ACK / NAK response register.\n         1= ACK. \n         0= NAK. \n Position */
#define SMB_PROMIS_CTRL_PROMIS_ACK_NAK_Msk    (0x1U << SMB_PROMIS_CTRL_PROMIS_ACK_NAK_Pos)   /**< (SMB_PROMIS_CTRL) This is the Promiscuous ACK / NAK response register.\n         1= ACK. \n         0= NAK. \n Mask */
#define SMB_PROMIS_CTRL_Msk                   (0x00000001UL)                                 /**< (SMB_PROMIS_CTRL) Register Mask  */

/** \brief SMB register offsets definitions */
#define SMB_CONTROL_OFFSET           (0x00)         /**< (SMB_CONTROL) Control Register Offset */
#define SMB_OWN_OFFSET               (0x04)         /**< (SMB_OWN) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. Offset */
#define SMB_DATA_REG_OFFSET          (0x08)         /**< (SMB_DATA_REG) This register holds the data that are either shifted out to or shifted in from the I2C port. Offset */
#define SMB_MASTER_COMMAND_OFFSET    (0x0C)         /**< (SMB_MASTER_COMMAND) SMBus Master Command Register Offset */
#define SMB_SLAVE_COMMAND_OFFSET     (0x10)         /**< (SMB_SLAVE_COMMAND) SMBus Slave Command Register Offset */
#define SMB_PEC_OFFSET               (0x14)         /**< (SMB_PEC) Packet Error Check (PEC) Register Offset */
#define SMB_REPEATED_START_HOLD_TIME_OFFSET (0x18)         /**< (SMB_REPEATED_START_HOLD_TIME) Repeated Start Hold Time Register Offset */
#define SMB_COMPLETION_OFFSET        (0x20)         /**< (SMB_COMPLETION) Completion Register Offset */
#define SMB_IDLE_SCALING_OFFSET      (0x24)         /**< (SMB_IDLE_SCALING) Idle Scaling Register Offset */
#define SMB_CONFIGURATION_OFFSET     (0x28)         /**< (SMB_CONFIGURATION) Configuration Register Offset */
#define SMB_BUS_CLOCK_OFFSET         (0x2C)         /**< (SMB_BUS_CLOCK) Bus Clock Register Offset */
#define SMB_BLOCK_ID_OFFSET          (0x30)         /**< (SMB_BLOCK_ID) Block ID Register Offset */
#define SMB_REVISION_OFFSET          (0x34)         /**< (SMB_REVISION) Revision Register Offset */
#define SMB_BIT_BANG_CONTROL_OFFSET  (0x38)         /**< (SMB_BIT_BANG_CONTROL) Bit-Bang Control Register Offset */
#define SMB_TEST_OFFSET              (0x3C)         /**< (SMB_TEST) Test Offset */
#define SMB_DATA_TIMING_OFFSET       (0x40)         /**< (SMB_DATA_TIMING) Data Timing Register Offset */
#define SMB_TIME_OUT_SCALING_OFFSET  (0x44)         /**< (SMB_TIME_OUT_SCALING) Time-Out Scaling Register Offset */
#define SMB_SLAVE_TRANSMIT_BUFFER_OFFSET (0x48)         /**< (SMB_SLAVE_TRANSMIT_BUFFER) SMBus Slave Transmit Buffer Register Offset */
#define SMB_SLAVE_RECEIVE_BUFFER_OFFSET (0x4C)         /**< (SMB_SLAVE_RECEIVE_BUFFER) SMBus Slave Receive Buffer Register Offset */
#define SMB_MASTER_TRANSMIT_BUFER_OFFSET (0x50)         /**< (SMB_MASTER_TRANSMIT_BUFER) SMBus Master Transmit Buffer Register Offset */
#define SMB_MASTER_RECEIVE_BUFFER_OFFSET (0x54)         /**< (SMB_MASTER_RECEIVE_BUFFER) SMBus Master Receive Buffer Register Offset */
#define SMB_WAKE_STATUS_OFFSET       (0x60)         /**< (SMB_WAKE_STATUS) WAKE STATUS Register Offset */
#define SMB_WAKE_ENABLE_OFFSET       (0x64)         /**< (SMB_WAKE_ENABLE) WAKE ENABLE Register Offset */
#define SMB_SLAVE_ADDRESS_OFFSET     (0x6C)         /**< (SMB_SLAVE_ADDRESS) This is the Slave Address Register Offset */
#define SMB_PROMISCUOUS_INT_OFFSET   (0x70)         /**< (SMB_PROMISCUOUS_INT) This is the Promiscuous Interrupt Register Offset */
#define SMB_PROMIS_INTEN_OFFSET      (0x74)         /**< (SMB_PROMIS_INTEN) This is the Promiscuous Interrupt Enable Register Offset */
#define SMB_PROMIS_CTRL_OFFSET       (0x78)         /**< (SMB_PROMIS_CTRL) This is the Promiscuous Control Register Offset */

/** \brief SMB register API structure */
typedef struct
{  /* The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
  __O   __SMB_CONTROL_bits_t           CONTROL;       /**< Offset: 0x00 ( /W  32) Control Register */
  __I   __SMB_STATUS_bits_t            STATUS;        /**< Offset: 0x00 (R/   32) Status Register */
  __IO  __SMB_OWN_bits_t               OWN;           /**< Offset: 0x04 (R/W  32) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. */
  __IO  __SMB_DATA_REG_bits_t          DATA_REG;      /**< Offset: 0x08 (R/W   8) This register holds the data that are either shifted out to or shifted in from the I2C port. */
  __IO  __SMB_MASTER_COMMAND_bits_t    MASTER_COMMAND; /**< Offset: 0x0C (R/W  32) SMBus Master Command Register */
  __IO  __SMB_SLAVE_COMMAND_bits_t     SLAVE_COMMAND; /**< Offset: 0x10 (R/W  32) SMBus Slave Command Register */
  __IO  __SMB_PEC_bits_t               PEC;           /**< Offset: 0x14 (R/W  32) Packet Error Check (PEC) Register */
  __IO  __SMB_REPEATED_START_HOLD_TIME_bits_t REPEATED_START_HOLD_TIME; /**< Offset: 0x18 (R/W  32) Repeated Start Hold Time Register */
  __IO  __SMB_COMPLETION_bits_t        COMPLETION;    /**< Offset: 0x20 (R/W  32) Completion Register */
  __IO  __SMB_IDLE_SCALING_bits_t      IDLE_SCALING;  /**< Offset: 0x24 (R/W  32) Idle Scaling Register */
  __IO  __SMB_CONFIGURATION_bits_t     CONFIGURATION; /**< Offset: 0x28 (R/W  32) Configuration Register */
  __IO  __SMB_BUS_CLOCK_bits_t         BUS_CLOCK;     /**< Offset: 0x2C (R/W  32) Bus Clock Register */
  __I   __SMB_BLOCK_ID_bits_t          BLOCK_ID;      /**< Offset: 0x30 (R/    8) Block ID Register */
  __I   __SMB_REVISION_bits_t          REVISION;      /**< Offset: 0x34 (R/    8) Revision Register */
  __IO  __SMB_BIT_BANG_CONTROL_bits_t  BIT_BANG_CONTROL; /**< Offset: 0x38 (R/W  32) Bit-Bang Control Register */
  __I   __SMB_TEST_bits_t              TEST;          /**< Offset: 0x3C (R/    8) Test */
  __IO  __SMB_DATA_TIMING_bits_t       DATA_TIMING;   /**< Offset: 0x40 (R/W  32) Data Timing Register */
  __IO  __SMB_TIME_OUT_SCALING_bits_t  TIME_OUT_SCALING; /**< Offset: 0x44 (R/W  32) Time-Out Scaling Register */
  __IO  __SMB_SLAVE_TRANSMIT_BUFFER_bits_t SLAVE_TRANSMIT_BUFFER; /**< Offset: 0x48 (R/W  32) SMBus Slave Transmit Buffer Register */
  __IO  __SMB_SLAVE_RECEIVE_BUFFER_bits_t SLAVE_RECEIVE_BUFFER; /**< Offset: 0x4C (R/W  32) SMBus Slave Receive Buffer Register */
  __IO  __SMB_MASTER_TRANSMIT_BUFER_bits_t MASTER_TRANSMIT_BUFER; /**< Offset: 0x50 (R/W  32) SMBus Master Transmit Buffer Register */
  __IO  __SMB_MASTER_RECEIVE_BUFFER_bits_t MASTER_RECEIVE_BUFFER; /**< Offset: 0x54 (R/W  32) SMBus Master Receive Buffer Register */
  __IO  __SMB_WAKE_STATUS_bits_t       WAKE_STATUS;   /**< Offset: 0x60 (R/W  32) WAKE STATUS Register */
  __IO  __SMB_WAKE_ENABLE_bits_t       WAKE_ENABLE;   /**< Offset: 0x64 (R/W  32) WAKE ENABLE Register */
  __IO  __SMB_SLAVE_ADDRESS_bits_t     SLAVE_ADDRESS; /**< Offset: 0x6C (R/W   8) This is the Slave Address Register */
  __IO  __SMB_PROMISCUOUS_INT_bits_t   PROMISCUOUS_INT; /**< Offset: 0x70 (R/W   8) This is the Promiscuous Interrupt Register */
  __IO  __SMB_PROMIS_INTEN_bits_t      PROMIS_INTEN;  /**< Offset: 0x74 (R/W   8) This is the Promiscuous Interrupt Enable Register */
  __IO  __SMB_PROMIS_CTRL_bits_t       PROMIS_CTRL;   /**< Offset: 0x78 (R/W   8) This is the Promiscuous Control Register */
} smb_registers_t;
/** @}  end of The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */

#endif /* _PIC32CX_0525SG12_SMB_COMPONENT_H_ */
